In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import missingno as msno
import os
from os import listdir
from os.path import isfile, join
import pprint

## Simple EDA

In [2]:
# get all files' name
mypath = './data'
allfiles = [f for f in listdir(mypath) if isfile(join(mypath, f))]

In [3]:
# print first 5 files' name
print(len(allfiles))
print(allfiles[0:5])

228
['tas_timeseries_annual_cru_1901-2020_ABW.csv', 'tas_timeseries_annual_cru_1901-2020_AFG.csv', 'tas_timeseries_annual_cru_1901-2020_AGO.csv', 'tas_timeseries_annual_cru_1901-2020_AIA.csv', 'tas_timeseries_annual_cru_1901-2020_ALB.csv']

In [4]:
# print country codes of allfiles[0]
print(allfiles[0][-7:-4])

ABW

In [5]:
# visualize single dataset
country_num = 0

df = pd.read_csv('./data/'+str(allfiles[country_num]), skiprows=[0]) # skip first row
df.rename(columns={'Unnamed: 0':'Year'}, inplace=True)
df_sliced = df.iloc[:,0:2]
country_name = str(df_sliced.columns.values[1])
country_code = str(allfiles[country_num][-7:-4])
print("Country Code: "+country_code)
print("Country Name: "+country_name)
df_sliced.head()

Country Code: ABW
Country Name: Aruba

   Year  Aruba
0  1901  27.60
1  1902  27.17
2  1903  27.27
3  1904  27.00
4  1905  27.05

In [6]:
df_sliced.set_index('Year', inplace=True)
df_final_1 = df_sliced.transpose()
df_final_1

Year,1901,1902,1903,1904,1905,1906,1907,1908,1909,1910,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
Aruba,27.6,27.17,27.27,27.0,27.05,26.96,26.93,26.84,26.89,26.89,...,28.31,28.52,28.64,28.67,29.04,29.17,28.68,28.38,28.75,28.76

In [7]:
# visualize single dataset
country_num = 1

df = pd.read_csv('./data/'+str(allfiles[country_num]), skiprows=[0]) # skip first row
df.rename(columns={'Unnamed: 0':'Year'}, inplace=True)
df_sliced = df.iloc[:,0:2]
country_name = str(df_sliced.columns.values[1])
country_code = str(allfiles[country_num][-7:-4])
print("Country Code: "+country_code)
print("Country Name: "+country_name)
df_sliced.head()

Country Code: AFG
Country Name: Afghanistan

   Year  Afghanistan
0  1901        13.08
1  1902        13.27
2  1903        12.11
3  1904        12.56
4  1905        12.33

In [8]:
df_sliced.set_index('Year', inplace=True)
df_final_2 = df_sliced.transpose()
df_final_2

Year,1901,1902,1903,1904,1905,1906,1907,1908,1909,1910,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
Afghanistan,13.08,13.27,12.11,12.56,12.33,12.81,12.19,12.56,13.04,12.48,...,13.85,13.24,14.18,13.61,13.97,14.5,14.12,14.55,13.86,13.25

In [9]:
# concate 2 dataframes
df_final_3 = pd.concat([df_final_1, df_final_2])
df_final_3

Year,1901,1902,1903,1904,1905,1906,1907,1908,1909,1910,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
Aruba,27.60,27.17,27.27,27.00,27.05,26.96,26.93,26.84,26.89,26.89,...,28.31,28.52,28.64,28.67,29.04,29.17,28.68,28.38,28.75,28.76
Afghanistan,13.08,13.27,12.11,12.56,12.33,12.81,12.19,12.56,13.04,12.48,...,13.85,13.24,14.18,13.61,13.97,14.50,14.12,14.55,13.86,13.25

In [10]:
df_empty = df_final_3.drop(labels=['Aruba','Afghanistan'], axis=0)
df_empty

Empty DataFrame
Columns: [1901, 1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, ...]
Index: []

[0 rows x 120 columns]

In [11]:
# Convert country code list & country name list into dict

# initializing lists
country_code_keys = []
country_name_values = []
  
# using zip()
# to convert lists to dictionary
countries_dict = dict(zip(country_code_keys, country_name_values))
  
# Printing resultant dictionary 
pprint.pprint(countries_dict, width=1)

{}

## Final Data Engineering Pipeline

In [12]:
df_final = df_empty.copy()

for file in allfiles:
    
    # read csv
    df = pd.read_csv('./data/'+str(file), skiprows=[0]) # skip first row
    df.rename(columns={'Unnamed: 0':'Year'}, inplace=True)
    
    # get 'Year' and 'Country Name' only
    df_sliced = df.iloc[:,0:2]
    country_name = str(df_sliced.columns.values[1])
    country_code = str(file[-7:-4])
    print(country_code+" : "+country_name)
    countries_dict[country_code] = str(country_name)
    
    # transpose and concate
    df_sliced.set_index('Year', inplace=True)
    df_temp = df_sliced.transpose()
    df_final = pd.concat([df_final, df_temp])

ABW : Aruba
AFG : Afghanistan
AGO : Angola
AIA : Anguilla
ALB : Albania
AND : Andorra
ARE : United Arab Emirates
ARG : Argentina
ARM : Armenia
ASM : American Samoa
ATG : Antigua and Barbuda
AUS : Australia
AUT : Austria
AZE : Azerbaijan
BDI : Burundi
BEL : Belgium
BEN : Benin
BFA : Burkina Faso
BGD : Bangladesh
BGR : Bulgaria
BHR : Bahrain
BHS : Bahamas, The
BIH : Bosnia and Herzegovina
BLR : Belarus
BLZ : Belize
BMU : Bermuda
BOL : Bolivia
BRA : Brazil
BRB : Barbados
BTN : Bhutan
BWA : Botswana
CAF : Central African Republic
CAN : Canada
CCK : Cocos (Keeling) Islands
CHE : Switzerland
CHL : Chile
CHN : China
CIV : Cote d'Ivoire
CMR : Cameroon
COD : Congo (Democratic Republic of the)
COG : Congo (Republic of the)
COK : Cook Islands
COL : Colombia
COM : Comoros
CPV : Cape Verde
CRI : Costa Rica
CUB : Cuba
CXR : Christmas Island
CYM : Cayman Islands
CYP : Cyprus
CZE : Czech Republic
DEU : Germany
DJI : Djibouti
DMA : Dominica
DNK : Denmark
DOM : Dominican Republic
DZA : Algeria
ECU : Ecuador
EGY : Egypt
ERI : Eritrea
ESH : 23.46

KeyError: "None of ['Year'] are in the columns"

## Fix file without countries name

In [14]:
for file in allfiles:
    
    # read csv
    df = pd.read_csv('./data/'+str(file), skiprows=[0]) # skip first row
    df.rename(columns={'Unnamed: 0':'Year'}, inplace=True)
    
    # get 'Year' and 'Country Name' only
    df_sliced = df.iloc[:,0:2]
    country_name = str(df_sliced.columns.values[1])
    country_code = str(file[-7:-4])
    countries_dict[country_code] = str(country_name)

In [15]:
# get the list of country codes that do not have name
def has_numbers(inputString):
    return any(char.isdigit() for char in inputString)

new_dict = {key: value for key, value in countries_dict.items() if has_numbers(countries_dict[key])}
new_dict

{'ESH': '23.46',
 'FLK': '6.38',
 'GLP': '25.83',
 'GUF': '26.11',
 'MTQ': '25.23',
 'MYT': '26.41',
 'REU': '20.25'}

In [16]:
countries_without_name = list(new_dict.keys())
countries_without_name

['ESH', 'FLK', 'GLP', 'GUF', 'MTQ', 'MYT', 'REU']

In [17]:
country_without_name = countries_without_name[0]
new_file_name = 'tas_timeseries_annual_cru_1901-2020_%s.csv' % country_without_name
print(new_file_name)

tas_timeseries_annual_cru_1901-2020_ESH.csv

In [19]:
df = pd.read_csv('./data/'+str(new_file_name))
df

     Variable:    tas
0         1901  23.46
1         1902  23.45
2         1903  23.20
3         1904  23.11
4         1905  23.24
..         ...    ...
115       2016  24.42
116       2017  24.67
117       2018  23.54
118       2019  24.15
119       2020  24.63

[120 rows x 2 columns]